# --------------------------задача---------------------------
# написать функцию is_positive(num), которая возвращает True в случае, если num положительное, и False во всех остальных случаях.
# Дан список чисел (только целые числа).
# Напечатать 0 и отрицательные числа в списке применив, функцию is_positive
#

# def is_positive(num):
#     if num > 0:
#         return True
#     else:
#         return False
#
# list = [24, -29, 35, -47, 64, -85, 99, -122, 146, 248, 12, -1, 22, 0]
# for num in list:
#     if is_positive(num) == False:
#         print(num)





# --------------------------задача-------------------
# написать функцию num_to_name_week(num_day_week), которая возвращает имя дня недели(строка)
# ПРимер
# num_to_name_week(1) -> ‘Понедельник’

# def num_to_name_week(num_day_week):
#     list_day_week = ["0" ,"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота","Воскресенье"]
#     print(list_day_week[num_day_week])
#
# num_day_week = int(input("Введите число недели: "))
# if num_day_week > 0 and num_day_week < 8:
#         num_to_name_week(num_day_week)
# else:
#     print("В неделе всего семь дней попробуйте заново.")

